;~ =============================================================================
;~ Rizonesoft Language File
;~ =============================================================================
;~ Date.........: 15 March 2025
;~ Author.......: Derick Payne (Rizonesoft)
;~ Link.........: https://rizonesoft.com
;~ =============================================================================

[Main]
Product = Firemin
Version = 12

[Language]
;~ Please ad the translated language name next to the English name. For example; Ελληνικά - Greek
Name = العربية - Arabic
Code = ar
Encoding = Unicode (UTF-16) LE BOM

[Translations]
;~ Please do not translate this section.
About = About
Custom = Custom
Donate = Donate
Menus = Menus
Messages = Messages
Messages2 = Messages2
Preferences = Preferences
Update = Update
Versioning = Versioning

[About]
Window_Title = حول %{Program.Name}
Label_Version = الإصدار
Label_AutoIt = البناء باستخدام إصدار النص التلقائي
Label_Copyright = حقوق النشر
Tip_Title_Donate = تبرع لقضيتنا
Tip_Message_Donate = عندما تتبرع، فإنك تساعد في الحفاظ على برامجنا المجانية\r\nوتمكننا من الحصول على الأدوات والخدمات\r\nالتي نستخدمها لخدمتك
Label_Home = الصفحة الرئيسية
Label_License = الرخصة
Label_Support = الحصول على الدعم
Tip_Title_Country = صنع في جنوب أفريقيا
Tip_Message_Country = ولد %{Program.Name} في جنوب أفريقيا
Label_Contributors = المساهمون
Button_Ok = موافق
Label_RAM = (الذاكرة) %d ميجابايت خالية من %d ميجابايت (%d%%)
Label_HDD = (%s) %.2f جيجابايت خالية من %.2f جيجابايت (%d%%)
Tip_Facebook = أعجب بنا على فيسبوك
Tip_GitHub = %{Program.Name} على GitHub

[Custom]
Label_Status_Welcome = ابدأ بتحميل المتصفح (حدد اسم الملف).\r\nسيكتشف %{Program.Name} تلقائياً العملية من الملف القابل للتنفيذ الذي تحدده.
Label_Status_Updates = جارٍ البحث عن التحديثات
Group_Load_Browser = تحميل المتصفح
Label_Executable = مسار الملف التنفيذي (%s):
Label_Process_Usage = الاستخدام | الذروة:
Label_Process_Count = عدد العمليات:
Button_Browse = &تصفح
Group_Options = الخيارات
Checkbox_Reduce_Mem = تقليل الذاكرة كل:
Label_Milliseconds = مللي ثانية
Checkbox_Reduce_Limit = تقليل الذاكرة فقط إذا تجاوز الاستخدام:
Checkbox_Start_With = بدء %s عند بدء %{Program.Name}
Checkbox_Enable_Extended_Processes = تمكين العمليات الممتدة
Button_Extended_Processes = &العمليات الممتدة
Checkbox_Start_Windows = بدء %{Program.Name} عند بدء تشغيل ويندوز
Label_Settings_Updated = تم تحديث الإعدادات بنجاح
Button_Cancel = إلغاء
Button_Save = حفظ
Time_Unit_01 = مللي ثانية
Time_Unit_02 = ثوانٍ
Time_Unit_03 = دقائق
Time_Unit_04 = ساعات
Label_Boost_Description = تقليل كل %s %s إذا تجاوز الاستخدام %s ميجابايت
Title_Select_Browser = اختر المتصفح
Tip_Minimized_Title = %{Program.Name} لا يزال قيد التشغيل!
Tip_Minimized_Message = سيستمر %{Program.Name} في العمل لتحسين استخدام ذاكرة %s.\r\nانقر على أيقونة علبة النظام لتغيير خيارات التحسين المختلفة.
Label_Notice = تم تصميم %{Program.Name} للعمل على أجهزة الكمبيوتر المكتبية والمحمولة.\r\nقمنا بإنشاء Firemin Server للبيئات الخادمة. اقرأ المزيد...

[Donate]
Label_Heading = ما رأيك في تقديم تبرع صغير للحفاظ على برامجنا مجانية للأبد؟
Label_Message = انقر على زر PayPal أدناه، اختر مبلغاً، وأرسل لنا التبرع.\r\nسيتم استخدام تبرعك لتحسين برامجنا والحفاظ على كل شيء مجانياً في Rizonesoft.\r\nتبرع بقيمة 20$ سيساعدنا في الاستمرار لمدة شهر على الأقل.
Label_Donate = هل تفكر في تقديم هدية صغيرة بقيمة 10$ لمساعدتنا في تحسين %{Program.Name} والحفاظ على استمرارنا؟

[Menus]
File = &ملف
File_Preferences = &تفضيلات
File_Close = &إغلاق\tShift+Alt+F4
Help = &مساعدة
Help_Update = التحقق من &التحديثات
Help_Home = الصفحة &الرئيسية لـ %{Company.Name}
Help_Downloads = المزيد من &التنزيلات
Help_Support = &الحصول على الدعم
Help_Issue = إنشاء &مشكلة
Help_Donate = تبرع &لقضيتنا
Help_About = حول %{Program.Name}
Tray_About = حول %{Program.Name} %s
Tray_Open = فتح %{Program.Name}
Tray_Extended_Processes = العمليات الممتدة
Tray_Run = تشغيل %s
Tray_Run_Safemode = تشغيل %s في الوضع الآمن

[Messages]
Info_Title = يرجى الملاحظة
Warning_Title = تحذير!
Error_Title = عذراً! حدث خطأ ما!
Error_Oops = عذراً!
Singleton = يتم بالفعل تشغيل نسخة أخرى من %{Program.Name}.\r\nتلميح: انقر على أيقونة %{Program.Name} في منطقة الإعلام.
Compatible = %{Program.Name} غير متوافق مع إصدار Windows الخاص بك.\r\nإذا كنت تعتقد أن هذا خطأ، فلا تتردد في ترك رسالة في '%s' مع كافة التفاصيل.
Compatible_Bit = للأسف %{Program.Name} 32 بت غير متوافق مع إصدار Windows الخاص بك.\r\nيرجى تنزيل %{Program.Name} 64 بت من '%s'

[Preferences]
Window_Title = التفضيلات
Tab_General = عام
Tab_Performance = الأداء
Tab_Language = اللغة
Group_Notifications = الإشعارات
Group_Extended_Processes = العمليات الممتدة
Group_Priority = الأولوية
Group_Memory = الذاكرة
Group_Language = اللغة
Checkbox_Notifications = عرض إشعارات علبة النظام
Label_Extended_Processes = أدخل هنا أسماء أي عمليات إضافية ترغب في أن يقوم %{Program.Name} بتحسينها.\r\nيجب أن تكون القائمة مفصولة بفواصل (Process01.exe, Process02.exe, إلخ)
Label_SetPriority = تعيين أولوية العملية:
Checkbox_SaveRealtime = حفظ الأولوية أعلى من عالية (غير مستحسن).
Checkbox_ReduceMemory = تقليل الذاكرة على أنظمة الذاكرة المنخفضة.
Label_Language_Message = حدد اللغة التي تفضلها واضغط على الزر %s للمتابعة.\r\n(يتطلب إعادة التشغيل)
Button_Save = حفظ
Button_Cancel = إلغاء
Label_Updated = تم تحديث التفضيلات
MsgBox_Language_Title = تم تغيير اللغة
MsgBox_Language_Message = تم تغيير اللغة المحددة.\r\nيجب إعادة تشغيل %{Program.Name} لتطبيق اللغة المختارة.
MsgBox_Closing_Title = إغلاق %{Program.Name}
MsgBox_Closing_Message = هل تريد إغلاق %{Program.Name} الآن؟

[Update]
Window_Title_Available = يتوفر تحديث
Window_Title_Congratulations = تهانينا!
Window_Title_Error = حدث خطأ ما!
Label_Message_Update = يتوفر إصدار جديد من '%{Program.Name}'.
Label_Message_Latest = أنت تستخدم أحدث إصدار من '%{Program.Name}'.
Label_Message_Error = تعذر استرداد معلومات حول أحدث إصدار من '%{Program.Name}'.
Label_Message_Internet = يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.
Label_Build_Current = الإصدار الحالي:
Label_Build_Update = إصدار التحديث:
CheckBox_NoUpdate = عدم التحقق من التحديثات عند بدء التشغيل.
Button_Update = اقرأ المزيد
Button_Close = إغلاق

[Versioning]
Administrator = مدير النظام
Build = الإصدار
AutoIt_Version = باستخدام إصدار AutoIt %{AutoIt.Version}
Bit = بت